#!/usr/bin/env bash
set -euo pipefail

###############################
# 🎲 이모지 배열 정의
###############################
ME_EMOJI=(💡 ✅️ ⛔ 🚫 ⚙️ 🧩 ✨ ⚠️ 💻 🐶 🐱 🐹 🐰 🦊 🐻 🐼 🐯 🦁 🐮 🐸 😺 😸 😹 😻 😼 😽 🙀 🐣 🐳 🌏 🍎 🍳 ⚾️ 🏄 🚴 🎧 🎮 🏍 ✈️🏝️ 🕹️ ❤️💞 ⚽️ 🥊 🐘 🐒 🐨 🐺 🐷 🐧 🐥 🐔 🐦 🐍 🐄 🐟 🐉 🐋 🐌 🐙 🐝 🐞 🐛 🐳 🐐 🐃 🐡 🌸 🌹 🐆 🐫 🐈 🐊 🐩 🐾 🎃 🎅 💾 🎊 📷 🎁 🎇 🌆 ⛪ 🏬 🏤 😁 😝 🙈 🙉 💎 💗)

# 함수: 무작위 이모지를 반환
get_random_emoji() {
    echo "${ME_EMOJI[$((RANDOM % ${#ME_EMOJI[@]}))]}"
}

# ▣ [1] 공통 설정
f_pause() {
    echo;
    read -rp "$(get_random_emoji) 계속하려면 [Enter] 키를 누르세요..." _;
    echo;
}